<script>

export default {
  name: 'RefferalsPage',
}
</script>
<script setup>
import { VDataTable } from 'vuetify/labs/VDataTable';
// import data from '@/views/demos/forms/tables/data-table/datatable'
const count_of_people = ref(344);
const summ = ref(2345.77);
const count_of_pays = ref(14);
const count_without_paying = ref(16);
const funds_withdrawn = ref('В разработке');
const data = [
  {
    id: 1,
    link: 'https://t.me/AVmessage_bot?start=26413346',
    invite_friends: '92 чел',
    note: 'Главный менеджер'
  },
  {
    id: 2,
    link: 'https://t.me/AVmessage_bot?start=26413346',
    invite_friends: '92 чел',
    note: 'Главный менеджер'
  },
  {
    id: 3,
    link: 'https://t.me/AVmessage_bot?start=26413346',
    invite_friends: '92 чел',
    note: 'Главный менеджер'
  },
]
const headers = [
  {
    title: 'Ссылка',
    key: 'link',
  },
  {
    title: 'Приглашено людей',
    key: 'invite_friends',
  },
  {
    title: 'Примечание',
    key: 'note',
  }
]
const headers_referals = [
  {
    title: 'Имя Telegram',
    key: 'telegram_name',
  },
  {
    title: 'ID Telegram',
    key: 'telegram_id',
  },
  {
    title: 'Приглашен',
    key: 'invited',
  },
  {
    title: 'Партнерский %',
    key: 'procent',
  },
  {
    title: 'Начислено',
    key: 'summ',
  },
  {
    title: 'Ссылка',
    key: 'link',
  }
]
const data_referals = [
  {
    telegram_name: 'AV Message',
    telegram_id: '12354667',
    invited: '15.01.24',
    procent: '10%',
    summ: '10р',
    link: 'undefined'
  }
]
</script>




<template>
  <v-container class = "top-card d-flex align-center justify-center justify-md-start mt-13 rounded-lg">
        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect width="33" height="33" fill="#F5F5F5"/>
                <rect width="2170" height="1078" transform="translate(-517 -77)" fill="#F7F7F7"/>
                <rect x="-21.5" y="-23.5" width="1630" height="80" rx="5.5" fill="#EFE6FB" fill-opacity="0.48"/>
                <rect x="-21.5" y="-23.5" width="1630" height="80" rx="5.5" stroke="#D8E2EF"/>
                <path d="M32.5104 28.2753H0.489643C0.219164 28.2753 0 28.4945 0 28.7649V30.2338C0 30.5042 0.219164 30.7235 0.489643 30.7235H32.5104C32.7808 30.7235 33 30.5042 33 30.2338V28.7649C33 28.4945 32.7808 28.2753 32.5104 28.2753Z" fill="url(#paint0_linear_0_1)"/>
                <path d="M0.638081 26.0229H2.10701C2.37749 26.0229 2.59665 25.8036 2.59665 25.5333V14.5169C2.59665 14.2465 2.37749 14.0272 2.10701 14.0272H0.638081C0.367602 14.0272 0.148438 14.2465 0.148438 14.5169V25.5333C0.148437 25.8037 0.367602 26.0229 0.638081 26.0229Z" fill="url(#paint1_linear_0_1)"/>
                <path d="M5.68105 26.0236H7.14998C7.42046 26.0236 7.63962 25.8044 7.63962 25.534V8.64186C7.63962 8.37148 7.42046 8.15222 7.14998 8.15222H5.68105C5.41057 8.15222 5.19141 8.37148 5.19141 8.64186V25.534C5.19141 25.8045 5.41057 26.0236 5.68105 26.0236Z" fill="url(#paint2_linear_0_1)"/>
                <path d="M10.724 26.0233H12.1929C12.4634 26.0233 12.6826 25.804 12.6826 25.5336V11.5794C12.6826 11.309 12.4634 11.0897 12.1929 11.0897H10.724C10.4535 11.0897 10.2344 11.309 10.2344 11.5794V25.5336C10.2344 25.8041 10.4535 26.0233 10.724 26.0233Z" fill="url(#paint3_linear_0_1)"/>
                <path d="M15.767 26.0234H17.2359C17.5064 26.0234 17.7256 25.8041 17.7256 25.5337V2.76589C17.7256 2.49551 17.5064 2.27625 17.2359 2.27625H15.767C15.4965 2.27625 15.2773 2.49551 15.2773 2.76589V25.5337C15.2773 25.8042 15.4966 26.0234 15.767 26.0234Z" fill="url(#paint4_linear_0_1)"/>
                <path d="M20.808 26.0229H22.2769C22.5474 26.0229 22.7666 25.8037 22.7666 25.5333V10.9915C22.7666 10.7211 22.5474 10.5018 22.2769 10.5018H20.808C20.5375 10.5018 20.3184 10.7211 20.3184 10.9915V25.5333C20.3184 25.8038 20.5376 26.0229 20.808 26.0229Z" fill="url(#paint5_linear_0_1)"/>
                <path d="M25.851 26.0236H27.3199C27.5904 26.0236 27.8095 25.8044 27.8095 25.534V8.64186C27.8095 8.37148 27.5904 8.15222 27.3199 8.15222H25.851C25.5805 8.15222 25.3613 8.37148 25.3613 8.64186V25.534C25.3613 25.8045 25.5806 26.0236 25.851 26.0236Z" fill="url(#paint6_linear_0_1)"/>
                <path d="M30.8939 26.0232H32.3629C32.6333 26.0232 32.8525 25.804 32.8525 25.5336V13.3421C32.8525 13.0717 32.6333 12.8524 32.3629 12.8524H30.8939C30.6235 12.8524 30.4043 13.0717 30.4043 13.3421V25.5336C30.4043 25.8041 30.6235 26.0232 30.8939 26.0232Z" fill="url(#paint7_linear_0_1)"/>
                <defs>
                <linearGradient id="paint0_linear_0_1" x1="16.5" y1="28.2753" x2="16.5" y2="30.7235" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                <linearGradient id="paint1_linear_0_1" x1="1.37255" y1="14.0272" x2="1.37255" y2="26.0229" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                <linearGradient id="paint2_linear_0_1" x1="6.41551" y1="8.15222" x2="6.41551" y2="26.0236" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                <linearGradient id="paint3_linear_0_1" x1="11.4585" y1="11.0897" x2="11.4585" y2="26.0233" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                <linearGradient id="paint4_linear_0_1" x1="16.5015" y1="2.27625" x2="16.5015" y2="26.0234" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                <linearGradient id="paint5_linear_0_1" x1="21.5425" y1="10.5018" x2="21.5425" y2="26.0229" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                <linearGradient id="paint6_linear_0_1" x1="26.5854" y1="8.15222" x2="26.5854" y2="26.0236" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                <linearGradient id="paint7_linear_0_1" x1="31.6284" y1="12.8524" x2="31.6284" y2="26.0232" gradientUnits="userSpaceOnUse">
                <stop stop-color="#AE83FD"/>
                <stop offset="1" stop-color="#9155FD"/>
                </linearGradient>
                </defs>
        </svg>
        <h1 class = "top-card__h1 ml-2 d-none d-md-flex">AV-Tools</h1>
        <p class="top-card__text mt-0 mr-0 mb-0 ml-md-16 ml-2">Реферальная система</p>
    </v-container>


  <v-container class = "card-about rounded-lg mt-sm-5">
    <div class = "d-flex align-start justify-center card-about__column">
      <div>
        <svg class = "card-about__svg" xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 25 25" fill="none">
              <g clip-path="url(#clip0_0_214)">
              <path d="M14.1039 14.3911C13.9689 14.3911 13.8327 14.3574 13.7071 14.2859C11.5057 13.0301 8.49828 10.9167 7.79577 7.07779C7.55172 5.73845 7.7541 3.59249 9.12683 1.95065C9.88974 1.03836 11.3112 -0.0488281 13.7518 -0.0488281C17.3989 -0.0488281 19.204 2.35138 19.6768 4.59785C20.2472 7.30915 19.0536 10.8315 15.6688 12.3169C15.2627 12.4949 14.7909 12.3108 14.612 11.9064C14.4339 11.5017 14.6179 11.0298 15.0231 10.8522C17.6266 9.70993 18.5452 7.00684 18.1076 4.92668C17.6625 2.81296 16.0342 1.55106 13.7515 1.55106C12.2899 1.55106 11.148 2.03037 10.3574 2.97585C9.40471 4.1151 9.17595 5.71289 9.37222 6.79092C9.81559 9.21249 11.445 11.1525 14.5017 12.8967C14.8865 13.1159 15.0193 13.6044 14.7999 13.9877C14.6523 14.2466 14.3819 14.3911 14.1039 14.3911Z" fill="white"/>
              <path d="M24.2727 24.9512H11.74C11.297 24.9512 10.9385 24.5928 10.9385 24.1508C10.9385 23.7087 11.2976 23.3513 11.74 23.3513H23.4677C23.4398 19.9743 23.2311 17.7568 22.8455 16.7547C22.3327 15.4173 20.1258 14.2132 18.7806 13.6221C17.8411 15.2363 16.4323 16.3183 14.8287 16.6311C13.1294 16.9626 11.3935 16.3971 9.94073 15.0369C9.61775 14.7348 9.6017 14.2286 9.90422 13.9063C10.2069 13.5839 10.7139 13.5679 11.0371 13.8698C12.119 14.883 13.3235 15.2946 14.5204 15.0608C15.8278 14.8054 16.9785 13.7888 17.6774 12.2717C17.8524 11.8921 18.2904 11.7119 18.6826 11.8553C19.1598 12.0304 23.3674 13.6406 24.3417 16.1814C24.9978 17.8879 25.0732 21.5469 25.0732 24.1508C25.0738 24.5928 24.7151 24.9512 24.2727 24.9512Z" fill="white"/>
              <path d="M6.50262 24.9512C2.931 24.9512 0.0253906 22.0509 0.0253906 18.4855C0.0253906 14.9208 2.931 12.0209 6.50262 12.0209C10.074 12.0209 12.9797 14.9208 12.9797 18.4855C12.9797 22.0509 10.074 24.9512 6.50262 24.9512ZM6.50262 13.6211C3.81487 13.6211 1.62802 15.8035 1.62802 18.4858C1.62802 21.1685 3.81487 23.3513 6.50262 23.3513C9.19017 23.3513 11.3772 21.1685 11.3772 18.4855C11.3772 15.8035 9.19017 13.6211 6.50262 13.6211Z" fill="white"/>
              <path d="M5.4164 22.5327C4.98909 22.5327 4.56139 22.3702 4.23574 22.0452L3.69605 21.5071C3.38263 21.1947 3.38263 20.6881 3.69567 20.3757C4.0087 20.0633 4.51628 20.0633 4.82894 20.3757L5.36901 20.9137C5.39366 20.9385 5.43934 20.9389 5.46399 20.9137L7.35061 19.0314C7.37584 19.0068 7.37526 18.9612 7.35023 18.9366L6.81092 18.3974C6.49788 18.0846 6.49788 17.578 6.8113 17.2659C7.12434 16.9535 7.63192 16.9535 7.94457 17.2669L8.48426 17.8059C9.13518 18.4559 9.13518 19.5128 8.48426 20.1624L6.59726 22.0452C6.27161 22.3702 5.84391 22.5327 5.4164 22.5327Z" fill="white"/>
              <path d="M5.62626 19.94C5.42082 19.94 5.21595 19.8616 5.05924 19.7056L4.51898 19.1666C3.86826 18.5161 3.86864 17.4587 4.52032 16.8093L6.40656 14.9269C7.05728 14.278 8.11621 14.2776 8.76808 14.9269L9.30815 15.4659C9.62119 15.7783 9.62119 16.2849 9.30815 16.597C8.99512 16.9098 8.48715 16.9098 8.1745 16.597L7.63481 16.0583C7.60958 16.0335 7.56391 16.0335 7.53964 16.0587L5.65359 17.9407C5.63066 17.9636 5.63066 18.0134 5.65321 18.0355L6.1929 18.5747C6.50593 18.8871 6.50593 19.3937 6.1929 19.7056C6.03695 19.8616 5.83151 19.94 5.62626 19.94Z" fill="white"/>
              </g>
              <defs>
              <clipPath id="clip0_0_214">
              <rect width="25" height="25" fill="white"/>
              </clipPath>
              </defs>
        </svg>
      </div>
      <div class = "ml-2 d-flex flex-column  ml-2 d-flex flex-column">
        <div class = "card-about__title">Всего рефералов</div>
        <div class = "card-about__information">{{ count_of_people }} чел</div>
      </div>
    </div>
    <div class = "card-about__divider"></div>
    <div class = " d-flex align-start justify-center  card-about__column">
      <div>
          <svg class = "card-about__svg" xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 32 32" fill="none">
                  <path d="M28 11C27.7348 11 27.4804 11.1054 27.2929 11.2929C27.1054 11.4804 27 11.7348 27 12V23.26C23.5008 24.2723 19.7767 24.1991 16.32 23.05C12.6612 21.8425 8.73325 21.7072 5 22.66V8.74C8.50428 7.74388 12.2283 7.83454 15.68 9C19.7836 10.36 24.2164 10.36 28.32 9C28.572 8.91513 28.7799 8.73364 28.898 8.49547C29.0162 8.2573 29.0349 7.98195 28.95 7.73C28.8651 7.47804 28.6836 7.27012 28.4455 7.15197C28.2073 7.03382 27.932 7.01513 27.68 7.1C23.9916 8.3198 20.0084 8.3198 16.32 7.1C12.2164 5.74002 7.78359 5.74002 3.68 7.1C3.48925 7.16417 3.32231 7.2844 3.20099 7.44497C3.07967 7.60554 3.00962 7.79898 3 8V24C3.00073 24.1586 3.0392 24.3148 3.11223 24.4557C3.18527 24.5965 3.29076 24.718 3.42 24.81C3.54822 24.9029 3.69667 24.9641 3.85314 24.9884C4.0096 25.0128 4.16962 24.9996 4.32 24.95C8.00843 23.7302 11.9916 23.7302 15.68 24.95C19.7836 26.31 24.2164 26.31 28.32 24.95C28.5186 24.8829 28.6911 24.7551 28.8132 24.5846C28.9352 24.4142 29.0005 24.2096 29 24V12C29 11.7348 28.8946 11.4804 28.7071 11.2929C28.5196 11.1054 28.2652 11 28 11Z" fill="white"/>
                  <path d="M12.1099 10.1404C10.7078 9.98045 9.29199 9.98045 7.88987 10.1404C7.62466 10.155 7.3761 10.2744 7.19887 10.4722C7.02165 10.6701 6.93029 10.9302 6.94487 11.1954C6.95946 11.4607 7.07881 11.7092 7.27666 11.8864C7.47451 12.0637 7.73466 12.155 7.99987 12.1404H8.09987C9.35933 12.0004 10.6304 12.0004 11.8899 12.1404C12.1551 12.1696 12.421 12.0922 12.6292 11.9253C12.8374 11.7584 12.9707 11.5157 12.9999 11.2504C13.029 10.9852 12.9517 10.7193 12.7848 10.5111C12.6179 10.303 12.3751 10.1696 12.1099 10.1404Z" fill="white"/>
                  <path d="M19.8899 22.0004C20.6199 22.0704 21.3199 22.1104 22.0199 22.1104C22.7199 22.1104 23.3999 22.1104 24.1099 22.0004C24.372 21.9726 24.6125 21.8425 24.7791 21.6384C24.9458 21.4343 25.0251 21.1727 24.9999 20.9104C24.9698 20.6482 24.8372 20.4087 24.6312 20.2438C24.4251 20.079 24.1623 20.0023 23.8999 20.0304C22.6438 20.1704 21.3761 20.1704 20.1199 20.0304C19.9886 20.0159 19.8557 20.0275 19.7289 20.0644C19.602 20.1013 19.4837 20.1629 19.3806 20.2455C19.1725 20.4124 19.0391 20.6552 19.0099 20.9204C18.9808 21.1856 19.0581 21.4515 19.2251 21.6597C19.392 21.8679 19.6347 22.0012 19.8999 22.0304L19.8899 22.0004Z" fill="white"/>
                  <path d="M16 20C16.7911 20 17.5645 19.7654 18.2223 19.3259C18.8801 18.8864 19.3928 18.2616 19.6955 17.5307C19.9983 16.7998 20.0775 15.9956 19.9231 15.2196C19.7688 14.4437 19.3878 13.731 18.8284 13.1716C18.269 12.6122 17.5563 12.2312 16.7804 12.0769C16.0044 11.9225 15.2002 12.0017 14.4693 12.3045C13.7384 12.6072 13.1136 13.1199 12.6741 13.7777C12.2346 14.4355 12 15.2089 12 16C12 17.0609 12.4214 18.0783 13.1716 18.8284C13.9217 19.5786 14.9391 20 16 20ZM16 14C16.3956 14 16.7822 14.1173 17.1111 14.3371C17.44 14.5568 17.6964 14.8692 17.8478 15.2346C17.9991 15.6001 18.0387 16.0022 17.9616 16.3902C17.8844 16.7781 17.6939 17.1345 17.4142 17.4142C17.1345 17.6939 16.7781 17.8844 16.3902 17.9616C16.0022 18.0387 15.6001 17.9991 15.2346 17.8478C14.8692 17.6964 14.5568 17.44 14.3371 17.1111C14.1173 16.7822 14 16.3956 14 16C14 15.4696 14.2107 14.9609 14.5858 14.5858C14.9609 14.2107 15.4696 14 16 14Z" fill="white"/>
          </svg>
        
      </div>
      <div class = "ml-2 d-flex flex-column ">
        <div class = "card-about__title">Всего начислено</div>
        <div class = "card-about__information">{{ summ }}</div>
      </div>
      
    </div>
    <div class = "card-about__divider"></div>
    <div class = " d-flex align-start justify-center  card-about__column">
      <div>
          <svg class = "card-about__svg"  xmlns="http://www.w3.org/2000/svg" width="30" height="30" viewBox="0 0 30 23" fill="none">
                      <path d="M27.3633 0H2.63672C1.18283 0 0 1.34054 0 2.98828V19.1914C0 20.8391 1.18283 22.1797 2.63672 22.1797H27.3633C28.8172 22.1797 30 20.8391 30 19.1914V2.98828C30 1.34054 28.8172 0 27.3633 0ZM28.2422 19.1914C28.2422 19.7407 27.8479 20.1875 27.3633 20.1875H2.63672C2.15209 20.1875 1.75781 19.7407 1.75781 19.1914V7.37109H28.2422V19.1914ZM28.2422 5.37891H1.75781V2.98828C1.75781 2.43904 2.15209 1.99219 2.63672 1.99219H27.3633C27.8479 1.99219 28.2422 2.43904 28.2422 2.98828V5.37891Z" fill="url(#paint0_linear_0_238)"/>
                      <path d="M5.625 16.8672H13.125C13.6104 16.8672 14.0039 16.4212 14.0039 15.8711C14.0039 15.321 13.6104 14.875 13.125 14.875H5.625C5.13961 14.875 4.74609 15.321 4.74609 15.8711C4.74609 16.4212 5.13961 16.8672 5.625 16.8672Z" fill="url(#paint1_linear_0_238)"/>
                      <path d="M5.625 12.6172H13.125C13.6104 12.6172 14.0039 12.1712 14.0039 11.6211C14.0039 11.071 13.6104 10.625 13.125 10.625H5.625C5.13961 10.625 4.74609 11.071 4.74609 11.6211C4.74609 12.1712 5.13961 12.6172 5.625 12.6172Z" fill="url(#paint2_linear_0_238)"/>
                      <path d="M19.6875 16.8672H25.3125C25.7979 16.8672 26.1914 16.4212 26.1914 15.8711V11.6211C26.1914 11.071 25.7979 10.625 25.3125 10.625H19.6875C19.2021 10.625 18.8086 11.071 18.8086 11.6211V15.8711C18.8086 16.4212 19.2021 16.8672 19.6875 16.8672ZM20.5664 12.6172H24.4336V14.875H20.5664V12.6172Z" fill="url(#paint3_linear_0_238)"/>
                      <defs>
                        <linearGradient id="paint0_linear_0_238" x1="15" y1="0" x2="15" y2="22.1797" gradientUnits="userSpaceOnUse">
                          <stop stop-color="white"/>
                          <stop offset="0.0001" stop-color="white"/>
                          <stop offset="1" stop-color="white"/>
                        </linearGradient>
                        <linearGradient id="paint1_linear_0_238" x1="9.375" y1="14.875" x2="9.375" y2="16.8672" gradientUnits="userSpaceOnUse">
                          <stop stop-color="white"/>
                          <stop offset="0.0001" stop-color="white"/>
                          <stop offset="1" stop-color="white"/>
                        </linearGradient>
                        <linearGradient id="paint2_linear_0_238" x1="9.375" y1="10.625" x2="9.375" y2="12.6172" gradientUnits="userSpaceOnUse">
                          <stop stop-color="white"/>
                          <stop offset="0.0001" stop-color="white"/>
                          <stop offset="1" stop-color="white"/>
                        </linearGradient>
                        <linearGradient id="paint3_linear_0_238" x1="22.5" y1="10.625" x2="22.5" y2="16.8672" gradientUnits="userSpaceOnUse">
                          <stop stop-color="white"/>
                          <stop offset="0.0001" stop-color="white"/>
                          <stop offset="1" stop-color="white"/>
                        </linearGradient>
                      </defs>
          </svg>
        
      </div>
      <div class = "ml-2 d-flex flex-column ">
        <div class = "card-about__title">Оплатили тариф</div>
        <div class = "card-about__information">{{ count_of_pays }} чел</div>
      </div>
      
    </div>
    <div class = "card-about__divider"></div>
    <div class = " d-flex align-start justify-center  card-about__column">
      <div>
          <svg class = "card-about__svg"  xmlns="http://www.w3.org/2000/svg" width="35" height="30" viewBox="0 0 35 32" fill="none">
              <path d="M31.5613 9.23599C31.6707 9.7062 31.7235 10.1859 31.7188 10.6667V21.3333C31.8044 22.0089 31.7218 22.6934 31.4773 23.3356C31.2327 23.9779 30.8325 24.5613 30.3066 25.0422C29.7806 25.5231 29.1425 25.889 28.44 26.1126C27.7376 26.3362 26.9889 26.4116 26.25 26.3333H13.125C12.8349 26.3333 12.5567 26.228 12.3516 26.0404C12.1465 25.8529 12.0313 25.5985 12.0313 25.3333C12.0313 25.0681 12.1465 24.8138 12.3516 24.6262C12.5567 24.4387 12.8349 24.3333 13.125 24.3333H26.25C28.5498 24.3333 29.5313 23.436 29.5313 21.3333V14.3333H26.25C25.9599 14.3333 25.6817 14.228 25.4766 14.0404C25.2715 13.8529 25.1563 13.5985 25.1563 13.3333C25.1563 13.0681 25.2715 12.8138 25.4766 12.6262C25.6817 12.4387 25.9599 12.3333 26.25 12.3333H29.5313V10.6667C29.535 10.3317 29.4998 9.99743 29.4263 9.66932C29.3704 9.41293 29.4266 9.14674 29.5828 8.92777C29.739 8.7088 29.9828 8.55446 30.2619 8.4978C30.541 8.44114 30.8334 8.48668 31.0762 8.62466C31.3191 8.76264 31.4932 8.98208 31.5613 9.23599ZM5.14792 28.7067C4.94058 28.8833 4.66635 28.9795 4.38299 28.9749C4.09963 28.9703 3.82928 28.8654 3.62889 28.6822C3.42849 28.4989 3.3137 28.2518 3.30871 27.9927C3.30371 27.7336 3.40889 27.4829 3.60209 27.2933L5.47167 25.584C4.72866 25.1153 4.1346 24.4752 3.74987 23.7286C3.36514 22.982 3.20346 22.1556 3.28125 21.3333V10.6667C3.19561 9.99111 3.27816 9.3066 3.52271 8.66434C3.76726 8.02208 4.16748 7.43868 4.69345 6.9578C5.21941 6.47692 5.85749 6.111 6.55997 5.88741C7.26244 5.66382 8.01112 5.58836 8.75 5.66666H26.25C26.5664 5.66733 26.8825 5.68558 27.1965 5.72132L29.8521 3.29332C30.0594 3.11668 30.3337 3.02052 30.617 3.02509C30.9004 3.02966 31.1707 3.13461 31.3711 3.31783C31.5715 3.50104 31.6863 3.74822 31.6913 4.00729C31.6963 4.26636 31.5911 4.51709 31.3979 4.70666L5.14792 28.7067ZM5.46875 10.6667V12.3333H19.9631L25.0673 7.66666H8.75C6.45021 7.66666 5.46875 8.56399 5.46875 10.6667ZM7.09917 24.096L10.484 21H10.2083C9.91825 21 9.64006 20.8946 9.43494 20.7071C9.22982 20.5196 9.11459 20.2652 9.11459 20C9.11459 19.7348 9.22982 19.4804 9.43494 19.2929C9.64006 19.1053 9.91825 19 10.2083 19H12.6715L17.7756 14.3333H5.46875V21.3333C5.46875 23.1733 6.25771 23.8227 7.09917 24.096Z" fill="white"/>
          </svg>
        
      </div>
      <div class = "ml-2 d-flex flex-column ">
        <div class = "card-about__title">Без оплаты</div>
        <div class = "card-about__information">{{ count_without_paying }} чел</div>
      </div>
      
    </div>
    <div class = "card-about__divider"></div>
    <div class = " d-flex align-start justify-center  card-about__column">
      <div>
          <svg class = "card-about__svg"  xmlns="http://www.w3.org/2000/svg" width="40" height="30" viewBox="0 0 40 43" fill="none">
              <path d="M28.7945 18.639H0.895099C0.400783 18.639 0 19.0701 0 19.6018V34.3728C0 34.905 0.400783 35.3356 0.895099 35.3356H28.7945C29.2896 35.3356 29.6905 34.9044 29.6905 34.3728V19.6022C29.6905 19.0707 29.2889 18.639 28.7945 18.639ZM27.8994 30.3738C27.6505 30.2626 27.3779 30.2005 27.0924 30.2005C25.9351 30.2005 24.9964 31.2096 24.9964 32.4542C24.9964 32.7971 25.0696 33.1199 25.1968 33.4105H4.43968C4.56611 33.1199 4.63932 32.7964 4.63932 32.4542C4.63932 31.2097 3.70133 30.2005 2.54404 30.2005C2.27785 30.2005 2.02524 30.2557 1.79103 30.3532V23.4756C2.02524 23.5721 2.27785 23.6284 2.54404 23.6284C3.70133 23.6284 4.63932 22.6193 4.63932 21.3748C4.63932 21.0893 4.58843 20.817 4.49798 20.5656H25.1383C25.0481 20.8165 24.9963 21.089 24.9963 21.3748C24.9963 22.6182 25.935 23.6284 27.0923 23.6284C27.3775 23.6284 27.65 23.5662 27.8993 23.4541L27.8994 30.3738ZM10.5304 23.6403H12.5003C11.517 24.4241 10.8762 25.6774 10.8762 27.0933C10.8762 28.3887 11.411 29.5473 12.2533 30.3357H10.5307V32.4547H19.16V30.3357H17.5017C18.3441 29.5473 18.8781 28.3887 18.8781 27.0933C18.8781 25.6774 18.2382 24.424 17.2545 23.6403H19.1595V21.5218H10.5304V23.6403ZM13.451 25.8262C13.451 24.9465 14.1138 24.2335 14.9324 24.2335C15.7509 24.2335 16.4145 24.9465 16.4145 25.8262C16.4145 26.3863 16.1446 26.8777 15.7375 27.1618C16.5101 27.4686 17.0628 28.2652 17.0628 29.2031H13.0118C13.0118 28.3167 13.5043 27.5568 14.2105 27.2158C13.7571 26.9444 13.451 26.4241 13.451 25.8262ZM34.6691 14.2779V29.0485C34.6691 29.5802 34.2689 30.0113 33.773 30.0113H30.5146V25.6239C30.8973 25.1659 31.4533 24.8759 32.0721 24.8759C32.3567 24.8759 32.6292 24.9375 32.8779 25.0498V18.1295C32.6305 18.2407 32.358 18.3029 32.0721 18.3029C30.915 18.3029 29.9757 17.2941 29.9757 16.0492C29.9757 15.7638 30.0269 15.4914 30.1184 15.2401H9.4767C9.56674 15.4914 9.61787 15.7639 9.61787 16.0492C9.61787 16.7456 9.32445 17.3674 8.86337 17.7806H4.97872V14.2774C4.97872 13.7451 5.3795 13.3146 5.87473 13.3146H33.773C34.2678 13.3146 34.6691 13.7455 34.6691 14.2779ZM24.1384 16.197V17.7806H15.5091V16.197H24.1384Z" fill="url(#paint0_linear_0_231)"/>
              <defs>
                <linearGradient id="paint0_linear_0_231" x1="20" y1="7.66455" x2="20" y2="35.3356" gradientUnits="userSpaceOnUse">
                  <stop stop-color="white"/>
                  <stop offset="1" stop-color="white"/>
                </linearGradient>
              </defs>
          </svg>
        
      </div>
      <div class = "ml-2 d-flex flex-column ">
        <div class = "card-about__title">Выведено средств</div>
        <div class = "card-about__information">{{ funds_withdrawn }}</div>
      </div>
      
    </div>
  </v-container>

  <v-container >
    <VRow class = "table-create-link rounded-lg mt-3">
        <VCol>
          <VCard>
            <VCardTitle>
            <div class = "d-flex align-center justify-space-between flex-column flex-md-row">
              <div class = "d-flex align-center justify-center">
              <svg xmlns="http://www.w3.org/2000/svg" width="33" height="33" viewBox="0 0 33 33" fill="none">
                        <rect width="32.9079" height="32.9079" rx="5" fill="#EFE5FF"/>
                        <path d="M26.3665 6.6335C24.1882 4.45555 20.6443 4.45546 18.4662 6.6335L14.1653 10.9345C13.6013 11.4984 13.1745 12.1572 12.8944 12.8945C12.1804 13.1659 11.5112 13.5885 10.937 14.1627L6.63606 18.4637C5.58107 19.5187 5 20.9215 5 22.4136C5 23.9058 5.58107 25.3086 6.63619 26.3638C7.72524 27.4528 9.15578 27.9973 10.5863 27.9973C12.0168 27.9973 13.4473 27.4528 14.5364 26.3638L18.8373 22.0628C19.4013 21.4988 19.8282 20.8401 20.1082 20.1029C20.8221 19.8314 21.4914 19.4088 22.0655 18.8346L26.3665 14.5336C28.5445 12.3556 28.5445 8.81167 26.3665 6.6335ZM18.3182 21.5437L14.0173 25.8447C12.1254 27.7365 9.04716 27.7365 7.15531 25.8447C6.23881 24.9282 5.73416 23.7097 5.73416 22.4137C5.73416 21.1176 6.23886 19.8991 7.15531 18.9827L11.4563 14.6818C13.3481 12.7899 16.4263 12.7899 18.3182 14.6817C18.4978 14.8613 18.6641 15.0556 18.8126 15.2591C18.9319 15.423 19.1617 15.4589 19.3254 15.3395C19.4892 15.2201 19.5252 14.9904 19.4058 14.8266C19.2351 14.5925 19.0438 14.3691 18.8375 14.1626C18.3618 13.687 17.8211 13.3153 17.2436 13.0475L21.0619 9.22913C21.4231 8.86801 21.9041 8.66909 22.4166 8.66909C22.9289 8.66909 23.41 8.86801 23.7711 9.22913C24.1323 9.59026 24.3311 10.0713 24.3311 10.5837C24.3311 11.0961 24.1323 11.5771 23.7711 11.9383L19.4702 16.2393C19.1091 16.6003 18.628 16.7993 18.1156 16.7993C17.6032 16.7993 17.1222 16.6003 16.761 16.2392C15.7279 15.2061 14.0468 15.2061 13.0136 16.2392L8.71271 20.5402C8.21291 21.04 7.93767 21.7055 7.93767 22.4139C7.93767 23.1223 8.21291 23.7877 8.71271 24.2875C9.21251 24.7873 9.8779 25.0626 10.5864 25.0626C11.2949 25.0626 11.9603 24.7873 12.4601 24.2875L16.5126 20.235C17.0347 20.3904 17.5751 20.4683 18.1156 20.4683C18.4745 20.4683 18.8333 20.434 19.1867 20.3655C18.9606 20.7969 18.6704 21.1916 18.3182 21.5437ZM25.8473 14.0145L21.5464 18.3155C19.6546 20.2074 16.5763 20.2073 14.6845 18.3155C14.5049 18.136 14.3386 17.9416 14.1902 17.7382C14.0708 17.5743 13.8411 17.5384 13.6773 17.6578C13.5135 17.7772 13.4775 18.0068 13.5969 18.1706C13.7676 18.4047 13.9589 18.6282 14.1653 18.8346C14.6409 19.3102 15.1817 19.6819 15.7591 19.9498L11.9408 23.7681C11.5797 24.1293 11.0986 24.3282 10.5862 24.3282C10.0738 24.3282 9.59278 24.1293 9.23161 23.7681C8.87052 23.407 8.67161 22.926 8.67161 22.4136C8.67161 21.9012 8.87052 21.4201 9.23165 21.059L13.5326 16.7581C14.2794 16.0112 15.4945 16.0112 16.2414 16.7577C16.7415 17.2578 17.4069 17.5331 18.1154 17.5331C18.8239 17.5331 19.4893 17.2579 19.9891 16.7581L24.2899 12.4571C24.7898 11.9573 25.065 11.2919 25.065 10.5834C25.065 9.87502 24.7898 9.20955 24.29 8.70979C23.7902 8.20994 23.1248 7.93471 22.4163 7.93471C21.7079 7.93471 21.0424 8.20994 20.5426 8.70975L16.4902 12.7623C15.6215 12.5036 14.7019 12.4601 13.8161 12.6318C14.042 12.2002 14.3323 11.8055 14.6845 11.4534L18.9854 7.15244C20.8772 5.26055 23.9555 5.26055 25.8473 7.15244C27.7392 9.04446 27.7392 12.1227 25.8473 14.0145Z" fill="#9155FD"/>
              </svg>
              <h1 class = "table-create-link__title">Создать реферальную ссылку</h1>
              </div>
              <button class = "table-create-link__button">Добавить ссылку</button>
            </div>
            </VCardTitle>
            <VCardText>
    <VDataTable
    :headers="headers"
    :items="data"
    :items-per-page="5"
    class="text-no-wrap table-referals__header-table"
    >
    <template #item.id="{ item }">
      <span class="text-h6">{{ item.id }}</span>
    </template>
  </VDataTable>
      </VCardText>
          </VCard>
        </VCol>
      </VRow>
  </v-container>

  <v-container>
    <VRow class = "table-referals">
        <VCol>
          <VCard>
            <VCardTitle><div class = "table-referals__flex-left">
      <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
          <rect width="32.9079" height="32.9079" rx="5" fill="#EFE5FF"/>
          <g clip-path="url(#clip0_0_202)">
          <path d="M17.9759 17.6642C17.8518 17.6642 17.7264 17.6345 17.6109 17.5715C15.5856 16.4664 12.8188 14.6067 12.1725 11.2285C11.9479 10.0498 12.1341 8.16139 13.397 6.71657C14.0989 5.91376 15.4067 4.95703 17.652 4.95703C21.0074 4.95703 22.668 7.06921 23.103 9.04611C23.6278 11.4321 22.5296 14.5317 19.4157 15.8389C19.0421 15.9955 18.608 15.8335 18.4434 15.4777C18.2795 15.1215 18.4489 14.7062 18.8216 14.55C21.2168 13.5447 22.0619 11.166 21.6593 9.33548C21.2498 7.4754 19.7519 6.36493 17.6517 6.36493C16.307 6.36493 15.2565 6.78673 14.5291 7.61874C13.6527 8.62129 13.4422 10.0273 13.6228 10.976C14.0307 13.107 15.5297 14.8142 18.342 16.3491C18.6959 16.542 18.8181 16.9718 18.6162 17.3092C18.4805 17.537 18.2317 17.6642 17.9759 17.6642Z" fill="#9155FD"/>
          <path d="M27.3305 26.9572H15.8004C15.3929 26.9572 15.063 26.6418 15.063 26.2529C15.063 25.8639 15.3934 25.5493 15.8004 25.5493H26.5899C26.5643 22.5776 26.3723 20.6262 26.0175 19.7443C25.5457 18.5674 23.5154 17.5078 22.2778 16.9876C21.4135 18.4081 20.1173 19.3603 18.642 19.6356C17.0786 19.9273 15.4817 19.4296 14.1451 18.2327C13.8479 17.9669 13.8332 17.5214 14.1115 17.2377C14.39 16.9541 14.8564 16.94 15.1538 17.2057C16.1491 18.0973 17.2573 18.4595 18.3584 18.2537C19.5612 18.029 20.6198 17.1343 21.2628 15.7993C21.4238 15.4653 21.8268 15.3067 22.1876 15.4329C22.6266 15.587 26.4976 17.0039 27.394 19.2398C27.9975 20.7415 28.067 23.9615 28.067 26.2529C28.0675 26.6418 27.7375 26.9572 27.3305 26.9572Z" fill="#9155FD"/>
          <path d="M10.9825 26.9568C7.6966 26.9568 5.02344 24.4045 5.02344 21.267C5.02344 18.1301 7.6966 15.5781 10.9825 15.5781C14.2682 15.5781 16.9414 18.1301 16.9414 21.267C16.9414 24.4045 14.2682 26.9568 10.9825 26.9568ZM10.9825 16.9864C8.50976 16.9864 6.49786 18.9069 6.49786 21.2673C6.49786 23.6281 8.50976 25.5489 10.9825 25.5489C13.455 25.5489 15.4671 23.6281 15.4671 21.267C15.4671 18.9069 13.455 16.9864 10.9825 16.9864Z" fill="#9155FD"/>
          <path d="M9.98262 24.8291C9.58949 24.8291 9.19601 24.6861 8.89641 24.4001L8.3999 23.9266C8.11155 23.6517 8.11155 23.2059 8.39954 22.9309C8.68754 22.656 9.15451 22.656 9.44215 22.9309L9.93902 23.4044C9.9617 23.4263 10.0037 23.4266 10.0264 23.4044L11.7621 21.748C11.7853 21.7263 11.7848 21.6862 11.7617 21.6645L11.2656 21.19C10.9776 20.9148 10.9776 20.469 11.2659 20.1944C11.5539 19.9194 12.0209 19.9194 12.3085 20.1952L12.8051 20.6696C13.4039 21.2416 13.4039 22.1716 12.8051 22.7433L11.069 24.4001C10.7694 24.6861 10.3759 24.8291 9.98262 24.8291Z" fill="#9155FD"/>
          <path d="M10.1764 22.5469C9.98739 22.5469 9.79891 22.4779 9.65474 22.3406L9.1577 21.8663C8.55903 21.294 8.55938 20.3634 9.15893 19.7919L10.8943 18.1354C11.4929 17.5644 12.4671 17.5641 13.0669 18.1354L13.5637 18.6098C13.8517 18.8847 13.8517 19.3305 13.5637 19.6051C13.2757 19.8804 12.8084 19.8804 12.5208 19.6051L12.0243 19.1311C12.0011 19.1093 11.959 19.1093 11.9367 19.1314L10.2015 20.7876C10.1804 20.8077 10.1804 20.8515 10.2012 20.871L10.6977 21.3455C10.9857 21.6204 10.9857 22.0662 10.6977 22.3406C10.5542 22.4779 10.3652 22.5469 10.1764 22.5469Z" fill="#9155FD"/>
          </g>
          <defs>
          <clipPath id="clip0_0_202">
          <rect width="23" height="22" fill="white" transform="translate(5 5)"/>
          </clipPath>
          </defs>
      </svg>
      <h1 class = "table-referals__title">Рефералы</h1>
    </div></VCardTitle>
            <VCardText>
              <VDataTable
                :headers="headers_referals"
                :items="data_referals"
                :items-per-page="5"
                class="text-no-wrap table-referals__header-table"
                >
                <template #item.id="{ item }">
                  <span class="text-h6">{{ item.id }}</span>
                </template>
              </VDataTable>
            </VCardText>
          </VCard>
        </VCol>
      </VRow>
  </v-container>


</template>


<style>
html, body {width:100%; overflow-x:hidden}
.top-card{
  display: flex;
  justify-content: flex-start;
  align-items: center;
  flex-wrap: nowrap;
  height: 81px;
  flex-shrink: 0;
  width: 100%;
  background: rgba(239, 230, 251, 0.48);
  border: 1px solid #D8E2EF;
  line-height: 27.65px;
}
  .top-card__h1{
    color: #9155FD;
    font-size: 23px;
    font-weight: 700;
  }
  .top-card__text{
    margin-left: 64px;
    color: #5B5B5B;
    font-size: 23px;
    font-weight: 400;
  }
.card-about{
  flex-wrap: nowrap;
  height: 81px;
  flex-shrink: 0;
  width: 100%;
  border: 1px solid #D8E2EF;
  background: linear-gradient(135deg,#AE83FD, #9155FD);
  color: #FFF;
  display: flex;
  align-items: center;
  justify-content: space-around;
}
  .card-about__title{
    text-align: left;
    font-size: 19px;
    font-style: normal;
    font-weight: 500;
    line-height: 24px;
    margin: 0;
    float: left;
    
  }
  .card-about__information{
    float: left;
    margin: 0;
    text-align: left;
    font-size: 24px;
    font-style: normal;
    font-weight: 500;
    line-height: 24px;
    text-transform: capitalize;
  }
  .card-about__divider{
    height: 110%;
    width: 1px;
    background-color: rgba(255, 255, 255, 0.35);

  }
.table-create-link{
  flex-wrap: nowrap;
  border: 1px solid #D3D3D3;
  background: rgba(252, 252, 252, 0.85);
}
  .table-create-link__title{
    margin-left: 10px;
    color: #9155FD;
    font-size: 23px;
    font-weight: 700;
  }
  .table-create-link__button{
    border-radius: 6px;
    background: linear-gradient(96deg, #B288FE 36.59%, #9155FD 70.91%);
    box-shadow: 0px 2px 5.1px 0px rgba(0, 0, 0, 0.11);
    width: 279px;
    height: 49px;
    flex-shrink: 0;
    margin-left: 31px;
    color: #FFF;
    font-size: 19px;
    font-style: normal;
    font-weight: 700;
    line-height: 24px;
  }
.table-referals{
  flex-wrap: nowrap;
  border-radius: 10px;
  border: 1px solid #D3D3D3;
  background: rgba(252, 252, 252, 0.85);
  margin-top:12px;
}
  .table-referals__flex-left{
    display: flex;
    align-items: center;
    justify-content: left;
  }
  .table-referals__title{
    margin-left: 10px;
    color: #9155FD;
    font-size: 23px;
    font-weight: 700;
  }
  .table-referals__header-table .v-data-table__td{
    background: #00808900 !important;
  }
  .table-referals__header-table .v-data-table__td{
    background: #00808900 !important;
  }
  .table-referals__header-table .v-data-table__tr:nth-child(even) {
  background-color: #fbfbfb !important;
}

.table-referals__header-table .v-data-table__tr:nth-child(odd) {
  background: #f5f2fb !important;
  
}
.table-referals__header-table{
  font-size: 19px !important;
  font-weight: 500;
}
.table-referals__header-table span{
  font-size: 19px;
  color: #777777;
  font-weight: 600;
}
.table-referals__header-table thead{
  background-color: #E1DBEF;
}
.table-referals__header-table{
  margin-top: 10px;
}
.table-referals .v-card--variant-elevated {
    box-shadow: none;
}
.table-referals .v-card--variant-elevated, .v-card--variant-flat {
    background: none;
}

.table-create-link .v-card--variant-elevated {
    box-shadow: none;
}
.table-create-link .v-card--variant-elevated, .v-card--variant-flat {
    background: none;
}
@media (max-width: 1280px) {
  .card-about__title{
    font-size: 16px;
  }
  .card-about__information{
    font-size: 19px;
  }
}
@media (max-width: 1060px) {
  .card-about__title{
    font-size: 19px;
  }
  .card-about__information{
    font-size: 24px;
  }
  .card-about__flex-content{
    align-items: center;
  }
  .card-about__svg{
    height: 40px;
    width: 40px;
  }
  
  .card-about__divider{
    display: none;
    margin: 0px;
  }
  .card-about{
    display: block;
    height: auto;
    background: #00000000;
    border: #00000000;
    margin: 0px;
  }
  .card-about__column{
    background: linear-gradient(135deg,#AE83FD, #9155FD);
    width: 100%;
    height: 100%;
    margin-right: 10px;
    padding: 10px 5px;
    border-radius: 6px;
    border: 1px solid #D8E2EF;
  }
  .table-create-link__button{
    margin: 0px;
    width: 50%;
  }
  .v-table__wrapper{
    width: 100% !important;
  }
  .card-about{
    display: grid;
    grid-template-columns: 49% 49%;
  }
  .card-about__column-item-5 {
    grid-column: span 2;
  }
}
@media (max-width: 960px) {
  .top-card__text{
    color: #9155FD;
    font-size: 23px;
    font-weight: 700;
    text-align: center;
  }
  .table-create-link__button{
    width: 100%;
    margin-top: 10px;
  }
}
@media (max-width: 800px) {
  .card-about__title{
    font-size: 16px;
    line-height: 100%;
  }
  .card-about__information{
    font-size: 19px;
  }
}

@media (max-width: 455px) {
  .table-create-link__title{
    font-size: 19px;
    margin-left: 2px;
  }
  .card-about__title{
    font-size: 14px;
  }
  .card-about__information{
    font-size: 16px;
  }
  .card-about__svg{
    height: 30px;
    width: 30px;
  }
}
@media (max-width: 380px) {
  .table-create-link__title{
    font-size: 16px;
  }
  .card-about{
    display: block;
  }
  .card-about__column{
    height: auto;
  }
}
</style>